ubuntu_chinese.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>中文解决方案</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="中文解决方案"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-11 Wed"/>
<meta name="author" content="Joseph Pan"/>
<meta name="description" content="Ubuntu中文解决方案"/>
<meta name="keywords" content="Ubuntu iconv 乱码 编码"/>
<link rel="stylesheet" href="./other/style.css" type="text/css"/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="./ubuntu_index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">中文解决方案</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 编码转换</a>
<ul>
<li><a href="#sec-1-1">1.1 查看文件编码</a></li>
<li><a href="#sec-1-2">1.2 转换文件名由GBK为UTF8</a></li>
<li><a href="#sec-1-3">1.3 批量转换src目录下的所有文件内容由GBK到UTF8</a></li>
<li><a href="#sec-1-4">1.4 转换文件内容由GBK到UTF8</a></li>
<li><a href="#sec-1-5">1.5 批量转换文件内容由GBK到UTF8</a></li>
<li><a href="#sec-1-6">1.6 转换 mp3 标签编码</a></li>
</ul>
</li>
<li><a href="#sec-2">2 乱码解决</a>
<ul>
<li><a href="#sec-2-1">2.1 程序显示有些字大，有些小</a></li>
<li><a href="#sec-2-2">2.2 PDF 文件乱码</a></li>
<li><a href="#sec-2-3">2.3 Flash中文乱码</a></li>
<li><a href="#sec-2-4">2.4 unzip 中文文件名乱码</a></li>
<li><a href="#sec-2-5">2.5 gedit中文乱码的解决</a></li>
<li><a href="#sec-2-6">2.6 解决vim中文编码问题，在~/.vimrc中加入</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 编码转换</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 查看文件编码</h3>
<div class="outline-text-3" id="text-1-1">





<pre class="example">enca 文件名
</pre>



<pre class="example">file 文件名
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 转换文件名由GBK为UTF8</h3>
<div class="outline-text-3" id="text-1-2">





<pre class="example">sudo apt-get install convmv
convmv -r -f cp936 -t utf8 --notest --nosmart *
</pre>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 批量转换src目录下的所有文件内容由GBK到UTF8</h3>
<div class="outline-text-3" id="text-1-3">





<pre class="example">find src -type d -exec mkdir -p utf8/{} \;
find src -type f -exec iconv -f GBK -t UTF-8 {} -o utf8/{} \;
mv utf8/* src
rm -fr utf8   
</pre>


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 转换文件内容由GBK到UTF8</h3>
<div class="outline-text-3" id="text-1-4">





<pre class="example">iconv -f gbk -t utf8 $i &gt; newfile
</pre>


</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 批量转换文件内容由GBK到UTF8</h3>
<div class="outline-text-3" id="text-1-5">





<pre class="example">for i in `find . *`; do if [ -f "$i" ]; then iconv -f gb2312 -t utf8 $i &gt; "./converted/$i" fi ; done
</pre>


</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 转换 mp3 标签编码</h3>
<div class="outline-text-3" id="text-1-6">





<pre class="example">sudo apt-get install python-mutagen
find . -iname '*.mp3' -execdir mid3iconv -e GBK {} \;
</pre>



</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 乱码解决</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 程序显示有些字大，有些小</h3>
<div class="outline-text-3" id="text-2-1">





<pre class="example">sudo apt-get remove ttf-kochi-gothic ttf-kochi-mincho ttf-unfonts ttf-unfonts-core
</pre>


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> PDF 文件乱码</h3>
<div class="outline-text-3" id="text-2-2">





<pre class="example">sudo apt-get install xpdf-chinese-simplified xpdf-chinese-traditional poppler-data
</pre>


</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Flash中文乱码</h3>
<div class="outline-text-3" id="text-2-3">





<pre class="example">sudo gedit /etc/fonts/conf.d/49-sansserif.conf 
将倒数第四行 &lt;string&gt;sans-serif&lt;/string&gt;
改为 &lt;string&gt;sans&lt;/string&gt;
保存即可，重启firefox
</pre>


</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> unzip 中文文件名乱码</h3>
<div class="outline-text-3" id="text-2-4">





<pre class="example">sudo apt-get install p7zip-full
export LANG=zh_CN.GBK  #临时在控制台修改环境为zh_CN.GBK，然后解压缩即可
7za e docs.zip
</pre>




</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> gedit中文乱码的解决</h3>
<div class="outline-text-3" id="text-2-5">




<pre class="example">gconftool-2 --set /apps/gedit-2/preferences/encodings/auto_detected "[UTF-8,CURRENT,GB18030,BIG5,ISO-8859-15,UTF-16]" --type list --list-type string
</pre>

</div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 解决vim中文编码问题，在~/.vimrc中加入</h3>
<div class="outline-text-3" id="text-2-6">




<pre class="example">let &amp;termencoding=&amp;encoding
set fileencodings=utf-8,gbk,ucs-bom,cp936
</pre>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-04-11 Wed</p>
<p class="author">Author: Joseph Pan</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
